In [1]:
import numpy as np
import pandas as pd

## 1) Count the number of product with respect to sub category from dataframe

In [2]:
subCategory = ["clothing",
               "clothing",
               "clothing",
               "car",
               "car",
               "bath & skin care",
               "bath & skin care"]

product = ["frocks",
           "shirt",
           "jeans pant", 
           "ride on car",
           "toy car", 
           "shampoos", 
           "soaps"]

In [3]:
df = pd.DataFrame(np.c_[subCategory, product], columns=['SubCategory', 'Product'])

df

        SubCategory      Product
0          clothing       frocks
1          clothing        shirt
2          clothing   jeans pant
3               car  ride on car
4               car      toy car
5  bath & skin care     shampoos
6  bath & skin care        soaps

In [4]:
df.groupby(by="SubCategory").SubCategory.value_counts()

SubCategory       SubCategory
bath & skin care  bath & skin care    2
car               car                 2
clothing          clothing            3
Name: SubCategory, dtype: int64

In [5]:
df.groupby(by="SubCategory")["SubCategory"].value_counts()

SubCategory       SubCategory
bath & skin care  bath & skin care    2
car               car                 2
clothing          clothing            3
Name: SubCategory, dtype: int64

## 2) Create DataFrame with two columns Name, Age. Create age_cat column from age.

age > 35 = senior

age <= 35 = junior

In [6]:
name = ["Alamin", "Nusrat Rita", "Taneem", "Tajnin Sultana", "Joty"]

age = [32,50,43,20,33]

df = pd.DataFrame(np.c_[name, age], columns=['Name', 'Age'])

df

             Name Age
0          Alamin  32
1     Nusrat Rita  50
2          Taneem  43
3  Tajnin Sultana  20
4            Joty  33

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      object
dtypes: object(2)
memory usage: 208.0+ bytes

In [8]:
df['Age'] = df['Age'].astype('int')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int32
dtypes: int32(1), object(1)
memory usage: 188.0+ bytes

In [10]:
df['Age'].apply(lambda a : 'Junior' if a<=35 else 'Senior')

0    Junior
1    Senior
2    Senior
3    Junior
4    Junior
Name: Age, dtype: object

In [11]:
df['Age_cat'] = df['Age'].apply(lambda a : 'Junior' if a<=35 else 'Senior')

df

             Name  Age Age_cat
0          Alamin   32  Junior
1     Nusrat Rita   50  Senior
2          Taneem   43  Senior
3  Tajnin Sultana   20  Junior
4            Joty   33  Junior